{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16, 1, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "name": "input_0", "inbound_nodes": []}, {"class_name": "Conv2DTranspose", "config": {"name": "LAYER_0", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 8], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [0, 0]}, "name": "LAYER_0", "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "LAYER_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "LAYER_1", "inbound_nodes": [[["LAYER_0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "LAYER_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "LAYER_2", "inbound_nodes": [[["LAYER_1", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "LAYER_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [0, 0]}, "name": "LAYER_3", "inbound_nodes": [[["LAYER_2", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "LAYER_3_crop", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "LAYER_3_crop", "inbound_nodes": [[["LAYER_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "LAYER_4", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "LAYER_4", "inbound_nodes": [[["LAYER_3_crop", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "LAYER_5", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "LAYER_5", "inbound_nodes": [[["LAYER_4", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "LAYER_6", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [0, 0]}, "name": "LAYER_6", "inbound_nodes": [[["LAYER_5", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "LAYER_6_crop", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "LAYER_6_crop", "inbound_nodes": [[["LAYER_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "LAYER_7", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "LAYER_7", "inbound_nodes": [[["LAYER_6_crop", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "LAYER_8", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "LAYER_8", "inbound_nodes": [[["LAYER_7", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "LAYER_9", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [0, 0]}, "name": "LAYER_9", "inbound_nodes": [[["LAYER_8", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "LAYER_9_crop", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "LAYER_9_crop", "inbound_nodes": [[["LAYER_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "LAYER_10", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "LAYER_10", "inbound_nodes": [[["LAYER_9_crop", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "LAYER_11", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "LAYER_11", "inbound_nodes": [[["LAYER_10", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "LAYER_12", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": [0, 0]}, "name": "LAYER_12", "inbound_nodes": [[["LAYER_11", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"name": "LAYER_12_crop", "trainable": true, "dtype": "float32", "cropping": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "LAYER_12_crop", "inbound_nodes": [[["LAYER_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "LAYER_13", "trainable": true, "dtype": "float32", "activation": "tanh"}, "name": "LAYER_13", "inbound_nodes": [[["LAYER_12_crop", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["LAYER_13", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "LAYER_0/kernel", "shape": [4, 8, 256, 16], "dtype": "float32"}, {"name": "LAYER_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "LAYER_1/beta", "shape": [256], "dtype": "float32"}, {"name": "LAYER_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "LAYER_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "LAYER_10/gamma", "shape": [32], "dtype": "float32"}, {"name": "LAYER_10/beta", "shape": [32], "dtype": "float32"}, {"name": "LAYER_10/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "LAYER_10/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "LAYER_12/kernel", "shape": [4, 4, 1, 32], "dtype": "float32"}, {"name": "LAYER_3/kernel", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "LAYER_4/gamma", "shape": [128], "dtype": "float32"}, {"name": "LAYER_4/beta", "shape": [128], "dtype": "float32"}, {"name": "LAYER_4/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "LAYER_4/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "LAYER_6/kernel", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "LAYER_7/gamma", "shape": [64], "dtype": "float32"}, {"name": "LAYER_7/beta", "shape": [64], "dtype": "float32"}, {"name": "LAYER_7/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "LAYER_7/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "LAYER_9/kernel", "shape": [4, 4, 32, 64], "dtype": "float32"}]}]}